victorzhengg/nrf5_sdk_17_1_0/examples/ble_peripheral/ble_app_blinky/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON:
            NRF_LOG_INFO("Send button state change.");
            err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE &&
                err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static void pwm0_handler(nrf_drv_pwm_evt_type_t event_type)
{
    if (event_type == NRF_DRV_PWM_EVT_STOPPED)
    {
				nrf_gpio_pin_set(20);
				NRF_LOG_INFO("pwm0_handler: NRF_DRV_PWM_EVT_STOPPED");
				nrf_pwm_sequence_set(m_pwm0.p_registers, 0, &m_pwm0_seq);
				nrf_gpio_pin_clear(20);
    }
}

static void pwm1_handler(nrf_drv_pwm_evt_type_t event_type)
{
    if (event_type == NRF_DRV_PWM_EVT_STOPPED)
    {
				NRF_LOG_INFO("pwm1_handler: NRF_DRV_PWM_EVT_STOPPED");
				nrf_pwm_sequence_set(m_pwm1.p_registers, 0, &m_pwm1_seq);
				nrf_drv_timer_enable(&m_timer0);
    }
}

static void pwm_init(void)
{
	  int index;
		int err_code;
	
    NRF_LOG_INFO("pwm_init");

																	/* pwm0 config*/
    /*-----------------------------------------------------------------------------*/
    nrf_drv_pwm_config_t const config0 =
    {
        .output_pins =
        {
            PWM0_OUT0, // channel 0
            PWM0_OUT1, // channel 1
            PWM0_OUT2, // channel 2
            PWM0_OUT3  // channel 3
        },
        .irq_priority = APP_IRQ_PRIORITY_LOWEST,
        .base_clock   = NRF_PWM_CLK_16MHz,
        .count_mode   = NRF_PWM_MODE_UP,
        .top_value    = 4000,            //250us period
        .load_mode    = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode    = NRF_PWM_STEP_AUTO
    };
    APP_ERROR_CHECK(nrf_drv_pwm_init(&m_pwm0, &config0, pwm0_handler));
		for(index=0;index<PWM_SEQ_LENGTH;index++)
		{
				m_pwm0_seq_values[index].channel_0 = index + 32768;
				m_pwm0_seq_values[index].channel_1 = index + 32768;
				m_pwm0_seq_values[index].channel_2 = index + 32768;
				m_pwm0_seq_values[index].channel_3 = index + 32768;
		}
		
		/* set the seq0*/
		nrf_pwm_sequence_set(m_pwm0.p_registers, 0, &m_pwm0_seq);
		
		/* set short between seq0_end and stop*/
		uint32_t shorts_mask = NRF_PWM_SHORT_SEQEND0_STOP_MASK;
		nrf_pwm_shorts_set(m_pwm0.p_registers, shorts_mask);
		
		/* enable the interrupt stoped*/
		uint32_t int_mask = NRF_PWM_INT_STOPPED_MASK;
		// The workaround for nRF52 Anomaly 109 "protects" DMA transfers
		int_mask |= NRF_PWM_INT_SEQEND0_MASK | NRF_PWM_INT_SEQEND1_MASK;
		nrf_pwm_int_set(m_pwm0.p_registers, int_mask);
		nrf_pwm_event_clear(m_pwm0.p_registers, NRF_PWM_EVENT_STOPPED);
		

		
		
		                           /* pwm1 config*/
		/*-----------------------------------------------------------------------------*/
    nrf_drv_pwm_config_t const config1 =
    {
        .output_pins =
        {
            PWM1_OUT0, // channel 0
            PWM1_OUT1, // channel 1
            PWM1_OUT2, // channel 2
            PWM1_OUT3  // channel 3
        },
        .irq_priority = APP_IRQ_PRIORITY_LOWEST,
        .base_clock   = NRF_PWM_CLK_16MHz,
        .count_mode   = NRF_PWM_MODE_UP,
        .top_value    = 4000,            //250us period
        .load_mode    = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode    = NRF_PWM_STEP_AUTO
    };
    APP_ERROR_CHECK(nrf_drv_pwm_init(&m_pwm1, &config1, pwm1_handler));
		for(index=0;index<PWM_SEQ_LENGTH;index++)
		{
				m_pwm1_seq_values[index].channel_0 = index;
				m_pwm1_seq_values[index].channel_1 = index;
				m_pwm1_seq_values[index].channel_2 = index;
				m_pwm1_seq_values[index].channel_3 = index;
		}
		
		/* set the seq0*/
		nrf_pwm_sequence_set(m_pwm1.p_registers, 0, &m_pwm1_seq);
		
		/* set short between seq0_end and stop*/
		shorts_mask = NRF_PWM_SHORT_SEQEND0_STOP_MASK;
		nrf_pwm_shorts_set(m_pwm1.p_registers, shorts_mask);
		
		/* enable the interrupt stoped*/
		int_mask = NRF_PWM_INT_STOPPED_MASK;
		// The workaround for nRF52 Anomaly 109 "protects" DMA transfers
		int_mask |= NRF_PWM_INT_SEQEND0_MASK | NRF_PWM_INT_SEQEND1_MASK;
		nrf_pwm_int_set(m_pwm1.p_registers, int_mask);
		nrf_pwm_event_clear(m_pwm1.p_registers, NRF_PWM_EVENT_STOPPED);
		

		                           /* TIMER0*/
		/*-----------------------------------------------------------------------------*/		
    // Check TIMER0 configuration for details.
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = NRF_TIMER_FREQ_1MHz;
    err_code = nrf_drv_timer_init(&m_timer0, &timer_cfg, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_extended_compare(&m_timer0,
                                   NRF_TIMER_CC_CHANNEL0,
                                   TRIGER_DELAY_PWM0_PWM1,
                                   NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK | NRF_TIMER_SHORT_COMPARE0_STOP_MASK,
                                   false);		
		
		
		                           /* PPI synchronize*/
		/*-----------------------------------------------------------------------------*/
    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

