victorzhengg/nrf5_sdk_17_1_0/examples/ble_peripheral/ble_app_blinky/main.c
    /* Configure 1st available PPI channel to stop TIMER0 counter on TIMER1 COMPARE[0] match,
     * which is every even number of seconds.
     */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
                                          nrf_drv_timer_event_address_get(&m_timer0,
                                                                          NRF_TIMER_EVENT_COMPARE0),
                                          nrf_pwm_task_address_get(m_pwm0.p_registers,
                                                                         NRF_PWM_TASK_SEQSTART0));
    APP_ERROR_CHECK(err_code);

		err_code = nrf_drv_ppi_channel_fork_assign(m_ppi_channel,
		                                           nrf_pwm_task_address_get(m_pwm1.p_registers,
                                                                         NRF_PWM_TASK_SEQSTART0));

    // Enable both configured PPI channels
    err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);

		nrf_drv_timer_enable(&m_timer0);

}
/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    log_init();
    leds_init();
    timers_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
	
    /*victor add pwm init*/
		pwm_init();
		nrf_gpio_pin_clear(20);
    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
